Sharki-66/womo-home-esp32/archive/firmware-modem/components/web_wifi/router_web/modem_http_config.c
    if (ps_ret != OS_SUCCESS) {
        ESP_LOGE(TAG, "Parser failed\n");
        return ESP_FAIL;
    }

    char str_val[64];

    if (json_obj_get_string(&jctx, "bandwidth", str_val, sizeof(str_val)) == OS_SUCCESS) {
        snprintf(user_bandwidth, sizeof(user_bandwidth), "%.*s", sizeof(user_bandwidth) - 1, str_val);
        ESP_LOGI(TAG, "bandwidth: %s\n", user_bandwidth);
    } else {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "invalid post");
        return ESP_FAIL;
    }

    if (json_obj_get_string(&jctx, "channel", str_val, sizeof(str_val)) == OS_SUCCESS) {
        snprintf(user_channel, sizeof(user_channel), "%.*s", sizeof(user_channel) - 1, str_val);
        ESP_LOGI(TAG, "channel: %s\n", user_channel);
    } else {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "invalid post");
        return ESP_FAIL;
    }

    char *json_str = NULL;
    size_t size = 0;
    size = asprintf(&json_str, "{\"status\":\"200\", \"bandwidth\":\"%s\", \"channel\":\"%s\"}", user_bandwidth,
                    user_channel);
    esp_err_t ret = httpd_resp_set_status(req, HTTPD_200);
    ESP_ERROR_CHECK(ret);
    ret = httpd_resp_set_type(req, HTTPD_TYPE_JSON);
    ESP_ERROR_CHECK(ret);
    ret = httpd_resp_send(req, json_str, size);
    free(json_str);
    ESP_ERROR_CHECK(ret);

    ESP_ERROR_CHECK(from_nvs_set_value("channel", user_channel));
    ESP_ERROR_CHECK(from_nvs_set_value("bandwidth", user_bandwidth));
    restart();

    return ESP_OK;
end:
    return ESP_OK;
}

static esp_err_t login_get_handler(httpd_req_t *req)
{

    char *json_str = NULL;
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "*");
    /**
     * @brief Set the HTTP status code
     */
    esp_err_t ret = httpd_resp_set_status(req, HTTPD_200);
    ESP_ERROR_CHECK(ret);

    /**
     * @brief Set the HTTP content type
     */
    ret = httpd_resp_set_type(req, HTTPD_TYPE_JSON);
    ESP_ERROR_CHECK(ret);

    /**
     * @brief Set some custom headers
     */

    ret = httpd_resp_send(req, json_str, sizeof(json_str));
    free(json_str);
    ESP_ERROR_CHECK(ret);
    return ESP_OK;
}

static esp_err_t login_post_handler(httpd_req_t *req)
{
    return ESP_OK;
}

static esp_err_t system_station_get_handler(httpd_req_t *req)
{
    esp_err_t err = basic_auth_get(req);
    REST_CHECK(err == ESP_OK, "not login yet", end);
    esp_modem_at_csq_t csq = { .rssi = 99, .ber = 99 };
    int csq_dbm = -999;
    at_handle_t at = usbh_modem_get_atparser();
    if (at) {
        if (at_cmd_get_signal_quality(at, &csq) == ESP_OK && csq.rssi != 99) {
            csq_dbm = -113 + 2 * csq.rssi;
        }
    }
    struct modem_netif_sta_info *node;
    bool first = true;
    char buf[192];

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "*");

    ESP_ERROR_CHECK(httpd_resp_set_status(req, HTTPD_200));
    ESP_ERROR_CHECK(httpd_resp_set_type(req, HTTPD_TYPE_JSON));

    httpd_resp_sendstr_chunk(req, "{\"station_list\":[");

    SLIST_FOREACH(node, &s_sta_list_head, field) {
        int len = snprintf(buf, sizeof(buf), "%s{\"name_str\":\"%s\",\"mac_str\":\"" MACSTR "\",\"ip_str\":\"" IPSTR "\",\"online_time_s\":\"%lld\"}",
                            first ? "" : ",",
                            node->name,
                            MAC2STR(node->mac),
                            IP2STR(&node->ip),
                            node->start_time);
        if (len < 0 || len >= (int)sizeof(buf)) {
            ESP_LOGW(TAG, "station json truncated");
            buf[sizeof(buf) - 2] = '}';
            buf[sizeof(buf) - 1] = '\0';
        }
        httpd_resp_sendstr_chunk(req, buf);
        first = false;
    }

    int len = snprintf(buf, sizeof(buf), "],\"signal\":{\"rssi\":%d,\"ber\":%d,\"dbm\":%d},\"now_time\":\"%lld\"}",
                      csq.rssi,
                      csq.ber,
                      csq_dbm,
                      esp_timer_get_time());
    if (len > 0 && len < (int)sizeof(buf)) {
        httpd_resp_sendstr_chunk(req, buf);
    }

    httpd_resp_sendstr_chunk(req, NULL); // Terminator

    return ESP_OK;
end:
    return ESP_OK;
}

static esp_err_t system_power_get_handler(httpd_req_t *req)
{
    esp_err_t err = basic_auth_get(req);
    REST_CHECK(err == ESP_OK, "not login yet", end);

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "*");

    ESP_ERROR_CHECK(httpd_resp_set_status(req, HTTPD_200));
    ESP_ERROR_CHECK(httpd_resp_set_type(req, HTTPD_TYPE_JSON));

    modem_power_status_t snap = {0};
    esp_err_t res = s_power_provider ? s_power_provider(&snap) : ESP_ERR_NOT_SUPPORTED;

    double age_s = 0.0;
    if (snap.timestamp_us > 0) {
        int64_t now = esp_timer_get_time();
        age_s = (double)(now - snap.timestamp_us) / 1000000.0;
        if (age_s < 0) {
            age_s = 0.0;
        }
    }

    char buf[192];
    if (res == ESP_OK && snap.valid) {
        int len = snprintf(buf, sizeof(buf), "{\"ok\":true,\"voltage\":%.3f,\"percent\":%.1f,\"age_s\":%.2f}",
                           snap.voltage, snap.percent, age_s);
        httpd_resp_send(req, buf, (len > 0) ? len : HTTPD_RESP_USE_STRLEN);
    } else if (s_power_provider == NULL) {
        const char *msg = "{\"ok\":false,\"msg\":\"kein Provider\"}";
        httpd_resp_send(req, msg, HTTPD_RESP_USE_STRLEN);
    } else {
        const char *msg = "{\"ok\":false,\"msg\":\"Messung fehlgeschlagen\"}";
        httpd_resp_send(req, msg, HTTPD_RESP_USE_STRLEN);
    }

    return ESP_OK;
end:
    return ESP_OK;
}

static esp_err_t system_station_delete_device_post_handler(httpd_req_t *req)
{
    esp_err_t err = basic_auth_get(req);
    REST_CHECK(err == ESP_OK, "not login yet", end);

