Sharki-66/womo-home-esp32/archive/firmware-modem/components/web_wifi/router_web/modem_http_config.c
    //rest_server_context_t* rest_context = (rest_server_context_t*)req->user_ctx->rest_context;
    ctx_info_t *ctx_info = (ctx_info_t *)req->user_ctx;
    rest_server_context_t *rest_context = ctx_info->rest_context;
    strlcpy(filepath, rest_context->base_path, sizeof(filepath));

    // Root → Horizon; /status → bisheriges index.html
    if (strcmp(req->uri, "/") == 0) {
        strlcat(filepath, "/horizon.html", sizeof(filepath));
    } else if (strcmp(req->uri, "/status") == 0) {
        strlcat(filepath, "/index.html", sizeof(filepath));
    } else if (req->uri[strlen(req->uri) - 1] == '/') {
        strlcat(filepath, "/index.html", sizeof(filepath));
    } else {
        strlcat(filepath, req->uri, sizeof(filepath));
    }
    int fd = open(filepath, O_RDONLY, 0);
    if (fd == -1) {
        ESP_LOGE(TAG, "Failed to open file : %s", filepath);
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to read existing file");
        return ESP_FAIL;
    }

    set_content_type_from_file(req, filepath);
    httpd_resp_set_hdr(req, "Cache-Control", "public, max-age=600, stale-while-revalidate=60");

    char *chunk = rest_context->scratch;
    ssize_t read_bytes;
    do {
        /* Read file in chunks into the scratch buffer */
        read_bytes = read(fd, chunk, SCRATCH_BUFSIZE);
        if (read_bytes == -1) {
            ESP_LOGE(TAG, "Failed to read file : %s", filepath);
        } else if (read_bytes > 0) {
            /* Send the buffer contents as HTTP response chunk */
            if (httpd_resp_send_chunk(req, chunk, read_bytes) != ESP_OK) {
                close(fd);
                ESP_LOGE(TAG, "File sending failed!");
                /* Abort sending file */
                httpd_resp_sendstr_chunk(req, NULL);
                /* Respond with 500 Internal Server Error */
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to send file");
                return ESP_FAIL;
            }
        }
    } while (read_bytes > 0);
    /* Close file after sending complete */
    close(fd);
    ESP_LOGD(TAG, "File sending complete");
    /* Respond with an empty chunk to signal HTTP response completion */
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
end:
    return ESP_OK;
}

static httpd_uri_t wlan_general = {
    .uri = "/wlan_general",
    .method = HTTP_GET,
    .handler = wlan_general_get_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t wlan_general_post = {
    .uri = "/wlan_general",
    .method = HTTP_POST,
    .handler = wlan_general_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t wlan_advance = {
    .uri = "/wlan_advance",
    .method = HTTP_GET,
    .handler = wlan_advance_get_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t wlan_advance_post = {
    .uri = "/wlan_advance",
    .method = HTTP_POST,
    .handler = wlan_advance_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t system_station_get = {
    .uri = "/system/station_state",
    .method = HTTP_GET,
    .handler = system_station_get_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t system_power_get = {
    .uri = "/system/power_state",
    .method = HTTP_GET,
    .handler = system_power_get_handler,
    .user_ctx = NULL
};

static httpd_uri_t login_get = {
    .uri = "/login",
    .method = HTTP_GET,
    .handler = login_get_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

// Platzhalter-IMU-API für den Horizont
static esp_err_t imu_get_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store, max-age=0");
    if (s_imu_fast_cb) {
        s_imu_fast_cb(2000, 500);
    }
    web_wifi_imu_snapshot_t snap = {0};
    bool ok = web_wifi_imu_get_snapshot(&snap);
    if (!ok) {
        const char *payload = "{\"ok\":false,\"msg\":\"IMU nicht verfuegbar\"}";
        return httpd_resp_send(req, payload, HTTPD_RESP_USE_STRLEN);
    }

    char payload[256] = {0};
    const char *calibrated = snap.calibrated ? "true" : "false";
    int len = snprintf(payload, sizeof(payload),
                       "{\"ok\":true,\"yaw_deg\":%.2f,\"roll_deg\":%.2f,\"pitch_deg\":%.2f,"
                       "\"cal\":[%u,%u,%u,%u],\"calibrated\":%s}",
                       snap.yaw_deg,
                       snap.roll_deg,
                       snap.pitch_deg,
                       snap.cal_sys,
                       snap.cal_gyro,
                       snap.cal_accel,
                       snap.cal_mag,
                       calibrated);
    if (len <= 0 || len >= (int)sizeof(payload)) {
        const char *fallback = "{\"ok\":false,\"msg\":\"IMU payload zu gross\"}";
        return httpd_resp_send(req, fallback, HTTPD_RESP_USE_STRLEN);
    }
    return httpd_resp_send(req, payload, HTTPD_RESP_USE_STRLEN);
}

static httpd_uri_t imu_get = {
    .uri = "/api/imu",
    .method = HTTP_GET,
    .handler = imu_get_handler,
    .user_ctx = NULL,
};

static httpd_uri_t login_post = {
    .uri = "/login",
    .method = HTTP_POST,
    .handler = login_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t system_station_delete_device_post = {
    .uri = "/system/station_state/delete_device",
    .method = HTTP_POST,
    .handler = system_station_delete_device_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_uri_t system_station_change_name_post = {
    .uri = "/system/station_state/change_name",
    .method = HTTP_POST,
    .handler = system_station_change_name_post_handler,
    /* Let's pass response string in user context to demonstrate it's usage */
    .user_ctx = NULL
};

static httpd_handle_t start_webserver(const char *base_path)
{
    ctx_info_t *ctx_info = calloc(1, sizeof(ctx_info_t));
    REST_CHECK(base_path, "wrong base path", err);
    ctx_info->rest_context = calloc(1, sizeof(rest_server_context_t));
    REST_CHECK(ctx_info->rest_context, "No memory for rest context", err);
    strlcpy(ctx_info->rest_context->base_path, base_path, sizeof(ctx_info->rest_context->base_path));

    ctx_info->basic_auth_info = calloc(1, sizeof(basic_auth_info_t));
    ctx_info->basic_auth_info->username = CONFIG_EXAMPLE_WEB_USERNAME;
    ctx_info->basic_auth_info->password = CONFIG_EXAMPLE_WEB_PASSWORD;

    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 15;
    config.lru_purge_enable = true;
    config.uri_match_fn = httpd_uri_match_wildcard;
    // Mehr gleichzeitige Verbindungen und Backlog zulassen (Grenze 7 wegen LWIP_MAX_SOCKETS)
    config.max_open_sockets = 7;    // default 7, nicht höher ohne LWIP_MAX_SOCKETS anzupassen
    config.backlog_conn = 10;       // default 5
    // Bump Server-Task: mehr Stack & höhere Prio, um lange Antwortzeiten zu vermeiden
    config.stack_size = 8 * 1024;      // Default 4096
    config.task_priority = 5;          // Default 4
    // TCP-Puffer im httpd erhöhen
    config.recv_wait_timeout = 10;     // Sekunden
    config.send_wait_timeout = 10;     // Sekunden
    // Keep-Alive aktivieren, damit Folge-Requests schneller sind (Tabswitch, Assets)
    config.keep_alive_enable = true;
    config.keep_alive_idle = 10;
    config.keep_alive_interval = 5;
    config.keep_alive_count = 3;

